# AddElectricalLoadArea Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaBasedLoadData..::..AddElectricalLoadArea Method
AreaBasedLoadData Class See Also
---
Adds electrical load area into the area based load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public void AddElectricalLoadArea(
	ElementId electricalLoadAreaId
)
```

Visual Basic
---
```text
Public Sub AddElectricalLoadArea ( _
	electricalLoadAreaId As ElementId _
)
```

Visual C++
---
```text
public:
void AddElectricalLoadArea(
	ElementId^ electricalLoadAreaId
)
```

# ### Parameters
electricalLoadAreaId
    Type: Autodesk.Revit.DB..::..ElementId The electrical load area id to add.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The id isn't a valid electrical load area. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace